In [414]:
import pandas as pd
import numpy as np

In [415]:
data= pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [416]:
data

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [417]:
data#----->as we can see the "Flight Numbers" are not increased by 10 and present nan values

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [418]:
#-------->making all "Flight Number" values as "0"
data['FlightNumber'][1:]=0

<ipython-input-418-8e045d61595c>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['FlightNumber'][1:]=0
C:\Users\saket\anaconda3\lib\site-packages\pandas\core\indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value)

In [419]:
#-------->incremnting the first value of "Flight number" 10 and starting placing the incremnt values as follows:
for i in range(0,len(data['FlightNumber'])):
    data['FlightNumber'][i+1]=data['FlightNumber'][i]+10

<ipython-input-419-6a03ddb6a248>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['FlightNumber'][i+1]=data['FlightNumber'][i]+10

In [420]:
data#------> As we can see the "Flight Number" are Incremented by 10

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [421]:
data.info()#------>as we can see the datatype of "Flight Number" is "Float64"

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   From_To       5 non-null      object
 1   FlightNumber  5 non-null      float64
 2   RecentDelays  5 non-null      object
 3   Airline       5 non-null      object
dtypes: float64(1), object(3)
memory usage: 288.0+ bytes

In [422]:
data['FlightNumber']=np.int64(data['FlightNumber'])#->converting into "int 64"

In [423]:
data.info()#-> as we can see the DType of "Flight Number" is int 64

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   From_To       5 non-null      object
 1   FlightNumber  5 non-null      int64
 2   RecentDelays  5 non-null      object
 3   Airline       5 non-null      object
dtypes: int64(1), object(3)
memory usage: 288.0+ bytes

2)The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [424]:
From_list=[]
To_list=[]
for i in data['From_To'].str.split('_'):
    To_list.append(i[1])
    From_list.append(i[0])

In [425]:
#To_list=[]
#for i in range(0,len(data['From_To'])):
    #for j in range(0,len(data['From_To'][i])):
        #if data['From_To'][i][j]=='_':
            #To_list.append(data['From_To'][i][j+1:])

In [426]:
To_list

['paris', 'miLAN', 'StockhOlm', 'PaRis', 'londOn']

In [427]:
#From_list=[]
#for i in range(0,len(data['From_To'])):
    #for j in range(0,len(data['From_To'][i])):
        #if data['From_To'][i][j]=='_':
            #From_list.append(data['From_To'][i][:j])

In [428]:
From_list

['LoNDon', 'MAdrid', 'londON', 'Budapest', 'Brussels']

In [429]:
data['From']=From_list

In [430]:
data['To']=To_list

In [431]:
data#------------> output

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

3)Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [432]:
data['From']=data['From'].str.title()

In [433]:
data['To']=data['To'].str.title()

In [434]:
data#----------->output

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),London,Paris
1,MAdrid_miLAN,10055,[],<Air France> (12),Madrid,Milan
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,London

4)Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [435]:
data

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),London,Paris
1,MAdrid_miLAN,10055,[],<Air France> (12),Madrid,Milan
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,London

In [436]:
data=data.drop(columns=['From_To'])

In [437]:
data#--->output

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

5)In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [438]:
delay_1=[]
delay_2=[]
delay_3=[]

In [444]:
for i in data['RecentDelays']:
    if len(i)==2:
        i.append(0)
    if len(i)==1:
        for j in range(0,2):
            i.append(0)
    if len(i)==0:
        for k in range(0,3):
            i.append(0)

In [440]:
for i in data['RecentDelays']:
    delay_1.append(i[0])
    delay_2.append(i[1])
    delay_3.append(i[2])

In [445]:
delay_1

[23, 0, 24, 13, 67]

In [446]:
delay_2

[47, 0, 43, 0, 32]

In [447]:
delay_3

[0, 0, 87, 0, 0]

In [450]:
data['Delay_1']=delay_1
data['Delay_2']=delay_2
data['Delay_3']=delay_3

In [454]:
data=data.drop(columns=['RecentDelays'])

In [456]:
data#---->last output

,FlightNumber,Airline,From,To,Delay_1,Delay_2,Delay_3
0,10045,KLM(!),London,Paris,23,47,0
1,10055,<Air France> (12),Madrid,Milan,0,0,0
2,10065,(British Airways. ),London,Stockholm,24,43,87
3,10075,12. Air France,Budapest,Paris,13,0,0
4,10085,"""Swiss Air""",Brussels,London,67,32,0